In [14]:
import pandas as pd

In [15]:
df=pd.read_csv('bmw.csv')
df.head(5)

,model,year,price,transmission,mileage,fuelType,tax,mpg,engineSize
0,5 Series,2014,11200,Automatic,67068,Diesel,125.0,57.6,2.0
1,6 Series,2018,27000,Automatic,14827,Petrol,145.0,42.8,2.0
2,5 Series,2016,16000,Automatic,62794,Diesel,160.0,51.4,3.0
3,1 Series,2017,12750,Automatic,26676,Diesel,145.0,72.4,1.5
4,7 Series,2014,14500,Automatic,39554,Diesel,160.0,50.4,3.0

In [3]:
df.describe()

,year,price,mileage,tax,mpg,engineSize
count,10781.000000,10781.000000,10781.000000,10781.000000,10781.000000,10781.000000
mean,2017.078935,22733.408867,25496.986550,131.702068,56.399035,2.167767
std,2.349038,11415.528189,25143.192559,61.510755,31.336958,0.552054
min,1996.000000,1200.000000,1.000000,0.000000,5.500000,0.000000
25%,2016.000000,14950.000000,5529.000000,135.000000,45.600000,2.000000
50%,2017.000000,20462.000000,18347.000000,145.000000,53.300000,2.000000
75%,2019.000000,27940.000000,38206.000000,145.000000,62.800000,2.000000
max,2020.000000,123456.000000,214000.000000,580.000000,470.800000,6.600000

In [5]:
df.dtypes

model            object
year              int64
price             int64
transmission     object
mileage           int64
fuelType         object
tax               int64
mpg             float64
engineSize      float64
dtype: object

In [16]:
##Handling missing values
df.isnull().any(axis=0)

model           False
year            False
price           False
transmission    False
mileage         False
fuelType        False
tax              True
mpg              True
engineSize       True
dtype: bool

In [17]:
df.isnull().sum()

model           0
year            0
price           0
transmission    0
mileage         0
fuelType        0
tax             1
mpg             1
engineSize      2
dtype: int64

In [19]:
##Filling the missing values with the mean of column
df['Sales_fillNA']=df['engineSize'].fillna(df['engineSize'].mean())
df.isnull().sum()

model           0
year            0
price           0
transmission    0
mileage         0
fuelType        0
tax             1
mpg             1
engineSize      2
Sales_fillNA    0
dtype: int64

In [20]:
df.dtypes

model            object
year              int64
price             int64
transmission     object
mileage           int64
fuelType         object
tax             float64
mpg             float64
engineSize      float64
Sales_fillNA    float64
dtype: object

In [25]:
##Renaming columns
df=df.rename(columns={'Sales_fillNA':'SF'})
df.head()

,model,year,price,transmission,mileage,fuelType,tax,mpg,engineSize,SF
0,5 Series,2014,11200,Automatic,67068,Diesel,125.0,57.6,2.0,2.0
1,6 Series,2018,27000,Automatic,14827,Petrol,145.0,42.8,2.0,2.0
2,5 Series,2016,16000,Automatic,62794,Diesel,160.0,51.4,3.0,3.0
3,1 Series,2017,12750,Automatic,26676,Diesel,145.0,72.4,1.5,1.5
4,7 Series,2014,14500,Automatic,39554,Diesel,160.0,50.4,3.0,3.0

In [27]:
##change datatypes
df['Value_new']=df['mileage'].fillna(df['mileage'].mean()).astype(float)
df.head()

,model,year,price,transmission,mileage,fuelType,tax,mpg,engineSize,SF,Value_new
0,5 Series,2014,11200,Automatic,67068,Diesel,125.0,57.6,2.0,2.0,67068.0
1,6 Series,2018,27000,Automatic,14827,Petrol,145.0,42.8,2.0,2.0,14827.0
2,5 Series,2016,16000,Automatic,62794,Diesel,160.0,51.4,3.0,3.0,62794.0
3,1 Series,2017,12750,Automatic,26676,Diesel,145.0,72.4,1.5,1.5,26676.0
4,7 Series,2014,14500,Automatic,39554,Diesel,160.0,50.4,3.0,3.0,39554.0

In [28]:
df['New']=df['tax'].apply(lambda x:x*2)
df.head()

,model,year,price,transmission,mileage,fuelType,tax,mpg,engineSize,SF,Value_new,New
0,5 Series,2014,11200,Automatic,67068,Diesel,125.0,57.6,2.0,2.0,67068.0,250.0
1,6 Series,2018,27000,Automatic,14827,Petrol,145.0,42.8,2.0,2.0,14827.0,290.0
2,5 Series,2016,16000,Automatic,62794,Diesel,160.0,51.4,3.0,3.0,62794.0,320.0
3,1 Series,2017,12750,Automatic,26676,Diesel,145.0,72.4,1.5,1.5,26676.0,290.0
4,7 Series,2014,14500,Automatic,39554,Diesel,160.0,50.4,3.0,3.0,39554.0,320.0

In [ ]:
##Data aggregating and grouping

##Grouping one
grouped_mean=df.groupby('transmission')['mileage'].mean()
print(grouped_mean)

transmission
Automatic    31830.679487
Manual       34720.485160
Semi-Auto    15631.347621
Name: mileage, dtype: float64

In [32]:
##Grouping two
grouped_sum=df.groupby(['transmission','fuelType'])['mpg'].sum()
print(grouped_sum)

transmission  fuelType
Automatic     Diesel      139870.7
              Electric      1412.4
              Hybrid       36355.5
              Other         7042.6
              Petrol       36031.4
Manual        Diesel      106057.3
              Petrol       41927.2
Semi-Auto     Diesel      160099.6
              Hybrid       10393.8
              Petrol       68644.4
Name: mpg, dtype: float64

In [33]:
## Aggregate multiple function
grouped_agg=df.groupby('transmission')['mpg'].agg(['mean','sum','count'])
print(grouped_agg)

                   mean       sum  count
transmission
Automatic     61.531252  220712.6   3587
Manual        58.561338  147984.5   2527
Semi-Auto     51.251136  239137.8   4666

In [36]:
##Merging and joining DataFrame

df1=pd.DataFrame({ 'keys':['A','B','C'],'Data1':[1,2,3]})
df2=pd.DataFrame({'keys':['A','B','D'],'Data2':[153,532,324]})

In [37]:
print(df1)

  keys  Data1
0    A      1
1    B      2
2    C      3

In [38]:
print(df2)

  keys  Data2
0    A    153
1    B    532
2    D    324

In [ ]:
pd.merge(df1,df2,on='keys',how='inner')##inner for keys present in both df1 and df2

  keys  Data1  Data2
0    A      1    153
1    B      2    532

In [41]:
pd.merge(df1,df2,on='keys',how='outer')##outer for keys both present and absent in  df1 and df2

  keys  Data1  Data2
0    A    1.0  153.0
1    B    2.0  532.0
2    C    3.0    NaN
3    D    NaN  324.0

In [42]:
pd.merge(df1,df2,on='keys',how='left')

  keys  Data1  Data2
0    A      1  153.0
1    B      2  532.0
2    C      3    NaN

In [43]:
pd.merge(df1,df2,on='keys',how='right')

  keys  Data1  Data2
0    A    1.0    153
1    B    2.0    532
2    D    NaN    324